// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).


     int n = 47;
     string text;
        
        if (n % 2 == 0)
        {
            text = "Да";
        }
        else
        {
            text = "Нет";
        }
        Console.WriteLine(text);

    
  